---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RoutingConditions
source: html/eaabb7bf-eb74-4955-b312-63ec13c32703.htm
---
# RoutingConditions Members

Constructs a new instance of a RoutingConditions object with an indicated
 error level for conditions that do not meet any routing preference rule.